RSN/src/InformationRegisters/СообщенияПередачиМастерданных/СообщенияПередачиМастерданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СообщенияПередачиМастерданных</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопытокОтправки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ОбъектыМетаданныхИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщенияОбОшибке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.ПередачаМастерданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МоментВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/СообщенияПередачиМастерданных/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет сообщение в очередь.
//
// Параметры:
//   Узел - ПланОбменаСсылка.ПередачаМастерданных - узел интегрированной системы.
//   ДвоичныеДанныеСообщения - ДвоичныеДанные - данные сообщения.
//   Идентификатор - УникальныйИдентификатор - идентификатор сообщения;
//
Процедура ДобавитьСообщение(Узел, ДвоичныеДанныеСообщения, Идентификатор = Неопределено, ОбъектМетаданных = Неопределено) Экспорт
	
	Менеджер = РегистрыСведений.СообщенияПередачиМастерданных.СоздатьМенеджерЗаписи();
	
	Менеджер.Узел = Узел;
	Менеджер.МоментВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Менеджер.Данные = Новый ХранилищеЗначения(ДвоичныеДанныеСообщения, Новый СжатиеДанных(9));
	Менеджер.ДатаСоздания = ТекущаяДатаСеанса();
	Менеджер.ОбъектМетаданных = ОбъектМетаданных;
	
	Если Идентификатор = Неопределено Тогда
		Менеджер.Идентификатор = Новый УникальныйИдентификатор();
	Иначе
		Менеджер.Идентификатор = Идентификатор;
	КонецЕсли;
	
	Менеджер.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
